######################################
#              Library               #
######################################

import math

######################################
#              Greeting              #
######################################

print("Приветсвую!\n")

######################################
#                Menu                #
######################################

print("Меню")
print("Введите номер действия из перечня, представленного ниже: \n")

print("РЯД ПРИБЛИЖЕННЫХ РАСЧЕТОВ")
print(" 1. Нахождение энтальпии")
print(" 2. Газовая постоянная")
print(" 3. Определение удельного объёма")
print(" 4. Показатель процесса")
print(" 5. Степень расширения в критическом сечении канала")
print(" 6. Определение скорости потока в критическом сечении канала")
print(" 7. Удельный объём продуктов сгорания")
print(" 8. Нахождение удельной площади критического сечения")
print(" 9. Степень расширения на срезе канала")
print("10. Скорость потока не срезе канала")
print("11. Определение удельной площади сопла")
print("12. Геометрическая степень расширение сопла\n")
    
print("РАСЧЕТ ПАРАМЕТРОВ ДВИГАТЕЛЯ")
print("13. Удельные импульс на земле")
print("14. Расход топлива")
print("15. Определение удельного импульса в пустоте")
print("16. Нахождение тяги в пустоте")
print("17. Площадь критического сечения и среза сопла")
print("18. Определение расходного комплекса и коэффициента тяги\n")

print("РАСЧЕТ КОЭФФИЦИЕНТОВ ПОТЕРЬ")
print("19. Коэффициент потерь в закритической части канала в пустоте")
print("20. Коэффициент, учитывающий влияние земного противодавления")
print("21. Коэффициент потерь в закритической части канала на земле\n")

print("РАСЧЕТ РЕАЛЬНЫХ ПАРАМЕТРОВ ДВИГАТЕЛЯ")
print("22. Удельный импульс в пустоте")
print("23. Удельный импульс на земле")
print("24. Расход топлива")
print("25. Расход горючего и окислителя")
print("26. Площадь критического сечения и среза канала")
print("27. Диаметр критического сечения и среза канала")
print("28. Тяга в пустоте")
print("29. Расходный комплекс и коэффициент тяги\n")

print("ПОСТОРОЕНИЕ ПРОФИЛЯ КАМЕРЫ СГОРАНИЯ ")
print("30. Определение приведенной и условной длины канала")
print("31. Относительная площадь канала")
print("32. Объём камеры")
print("33. Площадь поперечного сечения канала")
print("34. Радиус цилиндрической части канала")
print("35. Длина конфузора")
print("36. Размеры конфузора")
print("37. Объем конфузора")
print("38. Длина цилиндрической части")
print("39. Радиусы сопряжения\n")

print("завязанно на массиве ответов\n")
print("40. ОРИЕНТИРОВОЧНЫЙ РАСЧЁТ СМЕСИТЕЛЬНОЙ ГОЛОВКИ КАНАЛА")
print("41. Расчет двухкомпонентной форсунки")






######################################
#               Array                #
######################################

array = [['    Действие                                                             '], ['Ответ'],
         [' 1. Нахождение энтальпии ----------------------------------------- Iкс = '], [''],
         [" 2. Газовая постоянная ------------------------------------------- Rкс = "], [''],
         [" 3. Определение удельного объёма ------------------------------ u'k(c) = "], [''],
         [" 4. Показатель процесса --------------------------------------------- n' "], [''],
         [" 5. Степень расширения в критическом сечении канала -------------------- "], [''],
         [" 6. Определение скорости потока в критическом сечении канала --- ω(kp) = "], [''],
         [" 7. Удельный объём продуктов сгорания ------------------------- v'(kp) = "], [''],
         [" 8. Нахождение удельной площади критического сечения ---------- f'(kp) = "], [''],
         [" 9. Степень расширения на срезе канала -------------------------- п(с) = "], [''],
         ["10. Скорость потока не срезе канала ---------------------------- ω'(c) = "], [''],
         ["11. Определение удельной площади сопла ------------------------- f'(c) = "], [''],
         ["12. Геометрическая степень расширение сопла --------------------- F(c) = "], [''],
         ["13. Удельные импульс на земле -------------------------------- J*'(уд) = "], [''],
         ["14. Расход топлива ------------------------------------------------ m' = "], [''],
         ["15. Определение удельного импульса в пустоте ---------------- J**'(уд) = "], [''],
         ["16. Нахождение тяги в пустоте ----------------------------------- P**' = "], [''],
         ["17. Площадь критического сечения и среза сопла ------------ F'(kp)/(c) = "], [''],
         ["18. Определение расходного комплекса и коэффициента тяги ---------- B' = "], [''],
         ["19. Коэффициент потерь в закритической части канала в пустоте - φ**(с) = "], [''],
         ["20. Коэффициент, учитывающий влияние земного противодавления -- △φ(с) = "], [''],
         ["21. Коэффициент потерь в закритической части канала на земле --- φ0(с) = "], [''],
         ["22. Удельный импульс в пустоте ------------------------------- J**(уд) = "], [''],
         ["23. Удельный импульс на земле --------------------------------- J*(уд) = "], [''],
         ["24. Расход топлива ------------------------------------------------- m = "], [''],
         ["25. Расход горючего и окислителя ---------------------------- m(г)/(0) = "], [''],
         ["26. Площадь критического сечения и среза канала ------------ F(kp)/(c) = "], [''],
         ["27. Диаметр критического сечения и среза канала ------------ d(kp)/(c) = "], [''],
         ["28. Тяга в пустоте ----------------------------------------------- P** = "], [''],
         ["29. Расходный комплекс и коэффициент тяги -------------------------- В = "], [''],
         ["29. Расходный комплекс и коэффициент тяги --------------------- k**(t) = "], [''],
         ["30. Определение приведенной и условной длины канала -------------------- "], [''],
         ["31. Относительная площадь канала -------------------------------- F(k) = "], [''],
         ["32. Объём камеры ------------------------------------------------ V(к) = "], [''],
         ["33. Площадь поперечного сечения канала--------------------------- F(к) = "], [''],
         ["34. Радиус цилиндрической части канала -------------------------- R(к) = "], [''],
         ["35. Длина конфузора -------------------------------------------- l(вх) = "], [''],
         ["36. Размеры конфузора ---------------------------------------------- h = "], [''],
         ["36. Размеры конфузора ---------------------------------------------- H = "], [''],
         ["36. Размеры конфузора --------------------------------------------- y- = "], [''],
         ["36. Размеры конфузора ---------------------------------------------- y = "], [''],
         ["37. Объем конфузора ------------------------------------------ V(конф) = "], [''],
         ["38. Длина цилиндрической части ---------------------------------- l(ц) = "], [''],
         ["39. Радиусы сопряжения -------------------------------------------- R1 = "], [''],
         ["39. Радиусы сопряжения -------------------------------------------- R2 = "], [''],
         ["40. Определим шаг между форсунками --------------------------------- H = "], [''],
         ["40. Толщина пристеночного слоя головки --------------------------- lпр = "], [''],
         ["40. Найдём радиус ядра головки ------------------------------------ Rя = "], [''],
         ["40. Рассчитаем число концентрических окружностей ------------------- n = "], [''],
         ["40. Определим число форсунок ядра и пристеночного слоя -------- Z^я(ф) = "], [''],
         ["40. Определим число форсунок ядра и пристеночного слоя ------- Z^пр(ф) = "], [''],
         ["40. Определяем расход через форсунку ядра -------------------- m^я(фг) = "], [''],
         ["40. Определяем расход через форсунку ядра -------------------- m^я(фо) = "], [''],
         ["40. Определяем расход через форсунку пристеночного слоя ----- m^пр(фг) = "], [''],
         ["41. Определяем площадь сечения сопла форсунки ----------------- f^о(с) = "], [''],
         ["41. Определим dc --------------------------------------------------------"], [''],
         ["41. Диаметр закрутки ------------------------------------------ d^0(c) = "], [''],
         ["41. Диаметр входного отверстия в форсунку -------------------- d^0(вх) = "], [''],
         ["41. Определим скорость компонента на входе в форсунку ---------- ω(вх) = "], [''],
         ["41. Определим число Рейнольдса на входе ----------------------- Re(вх) = "], [''],
         [], [''],
         [], [''],
         [], [''],
         [], [''],
         [], ['']]

def action():    

######################################
#          Select action             #
######################################   

    user_input = int(input("Введите номер действия: "))

######################################
#             Main action            #
######################################

                                                    # first part
    if user_input == 1:
        print("Нахождение энтальпии\n")
        a = float(input("Введите значение I(ст): "))
        b = float(input("Введите значение P(кс): "))
        c = float(input("Введите значение p: "))
        array[3] = a + (b / c)
        print("Ответ: I(кс) = ", array[3], " кДж/кг")

    elif user_input == 2:
        print("Газовая постоянная\n")
        a = float(input("Введите значение R(0): "))
        b = float(input("Введите значение μ(к(с)): "))
        array[5] = a / b
        print("Ответ: R(k(c)) = ", array[5], " Дж/кг*К")

    elif user_input == 3:
        print("Определение удельного объёма\n")
        a = float(input("Введите значение R(к(с)): "))
        b = float(input("Введите значение T(т(с)): "))
        c = float(input("Введите значение P(к(с)): "))
        array[7] = (a * b) / c
        print("Ответ: v'(k(c)) = ", array[7], " м3/кг")

    elif user_input == 4:
        print("Показатель процесса\n")
        print("ТУТ ПИЗДЕЦ ЛОГАРИФМЫ, НАДО ПОТОМ ВЫУЧИТЬ И РАЗОБРАТЬСЯ")
        

    elif user_input == 5:
        print("Степень расширения в критическом сечении канала\n")
        print("хз, не сделал")
    
    elif user_input == 6:
        print("Определение скорости потока в критическом сечении канала\n")
        a = float(input("Введите значение n': "))
        b = float(input("Введите значение R(к): "))
        c = float(input("Введите значение T(к): "))
        array[13] = math.sqrt(2 * (a/(a+1)) * b * c)
        print("Ответ: ω(kp) = ", array[13], " м/c")

    elif user_input == 7:
        print("Удельный объём продуктов сгорания\n")
        a = float(input("Введите значение v'(к): "))
        b = float(input("Введите значение n': "))
        array[15] = a * ((b + 1) / 2)**(1 / (b-1))
        print("Ответ: v'(kp) = ", array[15], " м3/кг")

    elif user_input == 8:
        print("Нахождение удельной площади критического сечения\n")
        a = float(input("Введите значение v': "))
        b = float(input("Введите значение ω': "))
        array[17] = a / b
        print("Ответ: f'(kp) = ", array[17], " м2*c/кг")

    elif user_input == 9:
        print("Степень расширения на срезе канала\n")
        a = float(input("Введите значение P(c): "))
        b = float(input("Введите значение P(к): "))
        array[19] = a / b
        print("Ответ: п(с) = ", array[19], " ")

    elif user_input == 10:
        print("Степень расширения на срезе канала\n")
        print("квадратные скобки разберись")

    elif user_input == 11:
        print("Определение удельной площади сопла\n")
        a = float(input("Введите значение v'(с): "))
        b = float(input("Введите значение ω'(с): "))
        array[23] = a / b
        print("Ответ: f'(c) = ", array[23])

    elif user_input == 12:
        print("Геометрическая степень расширение сопла\n")
        a = float(input("Введите значение f'(c): "))
        b = float(input("Введите значение f'(кр): "))
        array[25] = a / b
        print("Ответ: F(c) = ", array[25])

                                                    #second part
    elif user_input == 13:
        print("Удельные импульс на земле\n")
        a = float(input("Введите значение ω(c): "))
        b = float(input("Введите значение f'(c): "))
        c = float(input("Введите значение P(c): "))
        d = float(input("Введите значение P(н): "))
        array[27] = a + b * (c - d)
        print("Ответ: J*'(уд) = ", array[27], " m/c")
    
    elif user_input == 14:
        print("Расход топлива\n")
        a = float(input("Введите значение P*: "))
        b = float(input("Введите значение J*'(уд): "))
        array[29] = a / b
        print("Ответ: m' = ", array[29], " кг/с")

    elif user_input == 15:
        print("Определение удельного импульса в пустоте\n")
        a = float(input("Введите значение ω(c): "))
        b = float(input("Введите значение f'(c): "))
        c = float(input("Введите значение P(c): "))
        array[31] = a + f * c
        print("Ответ: J**'(уд) = ", array[31], " m/c")

    elif user_input == 16:
        print("Нахождение тяги в пустоте\n")
        a = float(input("Введите значение J**'(уд): "))
        b = float(input("Введите значение m': "))
        array[33] = a * b
        print("Ответ: P**' = ", array[33], " kH")

    elif user_input == 17:
        print("Площадь критического сечения и среза сопла\n")
        a = float(input("Введите значение f'(kp): "))
        b = float(input("Введите значение m': "))
        array[35] = a *  b
        print("Ответ: F'(kp) = ", array[35], " m2")

    elif user_input == 18:
        print("Определение расходного комплекса и коэффициента тяги\n")
        a = float(input("Введите значение P(k): "))
        b = float(input("Введите значение F'(kp): "))
        c = float(input("Введите значение m': "))
        array[37] = (a * b) / c
        print("Ответ: B' = ", array[37], " m/c")


                                                # third part

    elif user_input == 19:
        print("Коэффициент потерь в закритической части канала в пустоте\n")
        a = float(input("Введите значение φ(a): "))
        b = float(input("Введите значение φ(w): "))
        array[39] = a * b
        print("Ответ: φ**(с) = ", array[39])
        
    elif user_input == 20:
        print("Коэффициент, учитывающий влияние земного противодавления\n")
        a = float(input("Введите значение F'(c): "))
        b = float(input("Введите значение P(н): "))
        c = float(input("Введите значение P**': "))
        array[41] = (a * b) / c
        print("Ответ: △φ(с) = ", array[41])

    elif user_input == 21:
        print("Коэффициент потерь в закритической части канала на земле\n")
        a = float(input("Введите значение ф**: "))
        b = float(input("Введите значение дельта △φ(с): "))
        c = float(input("Введите значение φ(с): "))
        array[43] = a * ((1 - (b / c)) / (1 - b))
        print("Ответ: φ0(с) = ", array[43])

                                                # fourth part
                                                
    elif user_input == 22:
        print("Удельный импульс в пустоте\n")
        a = float(input("Введите значение φ(k): "))
        b = float(input("Введите значение φ**(c): "))
        c = float(input("Введите значение J**'(уд): "))
        array[45] = a * b * c
        print("Ответ: J**(уд) = ", array[45])

    elif user_input == 23:
        print("Удельный импульс на земле\n")
        a = float(input("Введите значение φ(k): "))
        b = float(input("Введите значение φ*(c): "))
        c = float(input("Введите значение J*'(уд): "))
        array[47] = a * b * c
        print("Ответ: J*(уд) = ", array[47])

    elif user_input == 24:
        print("Расход топлива\n")
        a = float(input("Введите значение P*: "))
        b = float(input("Введите значение J*(уд): "))
        array[49] = a / b
        print("Ответ: m = ", array[49])
    
    elif user_input == 25:
        print("Расход горючего и окислителя\n")
        a = float(input("Введите значение k: "))
        b = float(input("Введите значение m: "))
        array[51] = (1 / (1 + a)) * b
        print("Ответ: m = ", array[51])

    elif user_input == 26:
        print("Площадь критического сечения и среза канала\n")
        a = float(input("Введите значение F'(kp): "))
        b = float(input("Введите значение φ**(с): "))
        array[53] = a / b
        print("Ответ: m = ", array[53])
    
    elif user_input == 27:
        print("Диаметр критического сечения и среза канала\n")
        a = float(input("Введите значение F(kp): "))
        array[55] = math.saqr((4 * a) / math.pi)
        print("Ответ: d(kp) = ", array[55])

    elif user_input == 28:
        print("Тяга в пустоте\n")
        a = float(input("Введите значение I**(уд): "))
        b = float(input("Введите значение m: "))
        array[57] = a * b
        print("Ответ: P** = ", array[57], " kH")
    
    elif user_input == 29:
        print("Расходный комплекс и коэффициент тяги\n")
        a = float(input("Введите значение φ(к): "))
        b = float(input("Введите значение B': "))
        array[59] = a * b
        print("Ответ: B' = ", array[59], " m/c\n")
    
        d = float(input("Введите значение P**: "))
        e = float(input("Введите значение P(k): "))
        f = float(input("Введите значение F(kp): "))
        array[61] = d / (e * f)
        print("Ответ: k**(т) = ", array[61])

                                            #fifth part
    
    #elif user_input == 30:

    elif user_input == 31:
        print("Относительная площадь канала\n")
        a = float(input("Введите значение F(к) или L(пр): "))
        b = float(input("Введите значение F(kp) или L(k): "))
        array[65] = a / b
        print("Ответ: F(k) = ", array[65])

    elif user_input == 32:
        print("Объём камеры\n")
        a = float(input("Введите значение L(пр): "))
        b = float(input("Введите значение F(kp): "))
        array[67] = a * b
        print("Ответ: V(k) = ", array[67])

    elif user_input == 33:
        print("Площадь поперечного сечения канала\n")
        a = float(input("Введите значение F(к): "))
        b = float(input("Введите значение F(kp): "))
        array[69] = a * b
        print("Ответ: F(k) = ", array[69])

    elif user_input == 34:
        print("Радиус цилиндрической части канала\n")
        a = float(input("Введите значение F(к): "))
        array[71] = math.sqrt((a / math.pi))
        print("Ответ: R(k) = ", array[71])

    elif user_input == 35:
        print("Длина конфузора\n")
        a = float(input("Введите значение d(kp): "))
        b = float(input("Введите значение p: "))
        c = float(input("Введите значение F(к): "))
        array[73] = 0.5 * a * math.sqrt((2 + b * math.sqrt(c))**2 - ((b - 1) * math.sqrt(c) + 3)**2)
        print("Ответ: l(вх) = ", array[73])

    elif user_input == 36:
        print("Размеры конфузора\n")
        a = float(input("Введите значение l(вх): "))
        b = float(input("Введите значение p: "))
        c = float(input("Введите значение F(к): "))
        i = float(input("Введите значение R(кp): \n"))
        array[75] = (2 * a)/(2 + b * math.sqrt(c))
        array[77] = a - d
        array[79] = (d / a) * math.sqrt(c) + (e / a)
        array[81] = f * i
        print("Ответ 1: h = ", array[75])
        print("Ответ 2: H = ", array[77])
        print("Ответ 3: y(с чёрточкой) = ", array[79])
        print("Ответ 4: y = ", array[81])

    elif user_input == 37:
        print("Объем конфузора\n")
        Fkp = float(input("Введите значение F(kp): "))
        lvh = float(input("Введите значение l(вх): "))
        Fk = float(input("Введите значение F(к): "))
        y = d = float(input("Введите значение y: "))
        H = e = float(input("Введите значение H: "))
        h = f = float(input("Введите значение h: "))
        array[83] = Fkp * lvh * (((2 * Fk + d**2) * (e / 3 * lvh)) + ((d**2 + d + 4) * (f / 6 * lvh)))
        print("Ответ: V(конф) = ", array[83])

    elif user_input == 38:
        print("Длина цилиндрической части\n")
        Vk = float(input("Введите значение V(k): "))
        Vkonf = float(input("Введите значение V(конф): "))
        Fk = float(input("Введите значение F(к): "))
        lc = array[85] = (Vk - Vkonf) / Fk
        print("Ответ: l(ц) = ", array[85])

    elif user_input == 39:
        print("Радиусы сопряжения")
        Rkp = float(input("Введите значение R(kp): "))
        p = float(input("Введите значение p: "))
        Rk = float(input("Введите значение R(k): "))
        R1 = array[87] = 2 * Rkp
        R2 = array[89] = p * Rk
        print("Ответ 1: R1 = ", array[87])
        print("Ответ 2: R2 = ", array[89])

################################################### sixth action ##################################################

    elif user_input == 40:
        print("Ориентировочный расчет смесительной головки канал\n")
        print("Определим шаг между форсунками Н")
        dyaf = float(input("Введите значение d^я(ф): "))
        dprf = float(input("Введите значение d^пр(ф): "))
        delta1 = float(input("Введите значение △1: "))
        H = array[91] = dyaf + delta1
        print("Ответ H = ", array[91])
       
        print("\nТолщина пристеночного слоя головки lпр")
        delta2 = float(input("Введите значение △2: "))
        lpr = array[93] = 1/2 * dyaf + dprf + delta1 + delta2
        print("Ответ lпр = ", array[93])

        print("\nНайдём радиус ядра головки R(я)")
        Rk = float(input("Введите значение R(k): "))
        Rya = array[95] = Rk - lpr
        print("Ответ R(я) = ", array[95])

        print("\nРассчитаем число концентрических окружностей n")
        n = array[97] = Rya / H
        print("Ответ n = ", array[97])

        print("\nОпределим число форсунок ядра и пристеночного слоя ")
        Zyaf = array[99] = 1 + 6 * math.factorial(int(n))
        print("Ответ Z^я(ф) = ", array[99])
        Zprf = array[101] = 6 * n
        print("Ответ Z^пр(ф) = ", array[101])

        print("\nОпределяем расход через форсунку ядра")
        mr = float(input("Введите значение m(r): "))
        myafg = array[103] = mr / (Zyaf + 0.5 * Zprf)
        print("Ответ m^я(фг) = ", array[103])
        mo = float(input("Введите значение m(o): "))
        myafo = array[105] = mo / Zyaf
        print("Ответ m^я(фо) = ", array[105])

        print("\nОпределяем расход через форсунку пристеночного слоя")
        mprfg = array[107] = (mr - myafg * Zyaf) / Zprf
        print("Ответ m^пр(фг) = ", array[107])

    elif user_input == 41:
        print("\nРасчет двухкомпонентной форсунки")
        print("Определяем площадь сечения сопла форсунки")
        A = float(input("Введите значение A: "))
        mu = float(input("Введите значение МЮ: "))
        f = float(input("Введите значение φ: "))
        p0 = float(input("Введите значение p0: "))
        P0f = float(input("Введите значение △P^0(ф): "))
        myafo = float(input("Введите значение m^я(фо): "))
        f0c = array[109] = myafo / (mu * math.sqrt(2 * p0 * P0f))
        print("Ответ f^0(c) = ", array[109])

        print("\nОпределим d(c)")
        d0c = array[111] = math.sqrt((4 * f0c) / math.pi)
        print("Ответ d^0(c) = ", array[111])

        print("\nДиаметр закрутки")
        xxx = float(input("Введите значение (x...y): "))
        dz = array[113] = xxx * d0c
        print("Ответ d(з) = ", array[113])

        print("\nДиаметр входного отверстия в форсунку")
        dc = float(input("Введите значение d(c): "))
        i = float(input("Введите значение i: "))
        d0vh = array[115] = math.sqrt((dz * dc) / (A * i))
        print("Ответ d^0(вх) = ", array[115])

        print("\nОпределим скорость компонента на входе в форсунку")
        m0fya = float(input("Введите значение m^0(фя): "))
        dvh = float(input("Введите значение d(вх): "))
        wvh = array[117] = (4 * m0fya) / (i * math.pi * dvh * p0)
        print("Ответ ω(вх) = ", array[117])

        print("\nОпределим число Рейнольдса на входе")
        yoban = float(input("Введите значение (какая-то ёбань, которая не выводится на экран, похожая на девятку (9). ): "))
        Revh = array[119] =(wvh * d0vh * math.sqrt(i)) / yoban
        print("Ответ Re(вх) = ", array[119])

        
action()

while True:
    flag = input("Продолжить? \n1 - да \n0 - выход ")
    if flag == '1':
        action()
    else:
        print("Ответы\n")
        print(array[0],    array[1])
        print(array[2],    array[3])
        print(array[4],    array[5])
        print(array[6],    array[7])
        print(array[8],    array[9])
        print(array[10],  array[11])
        print(array[12],  array[13])
        print(array[14],  array[15])
        print(array[16],  array[17])
        print(array[18],  array[19])
        print(array[20],  array[21])
        print(array[22],  array[23])
        print(array[24],  array[25])
        print(array[26],  array[27])
        print(array[28],  array[29])
        print(array[30],  array[31])
        print(array[32],  array[33])
        print(array[34],  array[35])
        print(array[36],  array[37])
        print(array[38],  array[39])
        print(array[40],  array[41])
        print(array[42],  array[43])
        print(array[44],  array[45])
        print(array[46],  array[47])
        print(array[48],  array[49])
        print(array[50],  array[51])
        print(array[52],  array[53])
        print(array[54],  array[55])
        print(array[56],  array[57])
        print(array[58],  array[59])
        print(array[60],  array[61])
        print(array[62],  array[63])
        print(array[64],  array[65])
        print(array[66],  array[67])
        print(array[68],  array[69])
        print(array[70],  array[71])
        print(array[72],  array[73])
        print(array[74],  array[75])
        print(array[76],  array[77])
        print(array[78],  array[79])
        print(array[80],  array[81])
        print(array[82],  array[83])
        print(array[84],  array[85])
        print(array[86],  array[87])
        print(array[88],  array[89])
        print(array[90],  array[91])
        print(array[92],  array[93])
        print(array[94],  array[95])
        print(array[96],  array[97])
        print(array[98],  array[99])
        print(array[100], array[101])
        print(array[102], array[103])
        print(array[104], array[105])
        print(array[106], array[107])
        print(array[108], array[109])
        print(array[110], array[111])
        print(array[112], array[113])
        print(array[114], array[115])
        print(array[116], array[117])
        print(array[118], array[119])
        
        
        print("\nВозвращайтесь!\n")
        print(" __________________")
        print("|    CKOMPADRE     |")
        print(" ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯")
        break
