# library
import math

# massives
answer = [["Рассчёт значения энтальпии", ],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , ''],
          ['' , '']]
        

fuel = [['76.8' , '-4465.3' , '14.9' , '21.2'],         # Hydrogen
        ['' , '' , '' , ''],
        ['' , '' , '' , '']]

oxidizer = [['76.8' , '-339.58' , '54.39' , '85.87'],   # Fluoride
            ['' , '' , '' , ''],
            ['' , '' , '' , '']]
# action
print("Приветствую!")
print("Программу разработал: Ckompadre\n")
